## <font color="yellow"><h4 align="center">Read/Write CSV and Excel Files in Pandas</font>

### <font color="green">Read CSV</color>

In [13]:
import pandas as pd

df = pd.read_csv("stock_data.csv")
df

   checkHD     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0  tickers            eps    revenue      price         people
1    GOOGL          27.82         87        845     larry page
2      WMT           4.61        484         65           n.a.
3     MSFT             -1         85         64     bill gates
4     RIL   not available         50       1023  mukesh ambani
5     TATA            5.6         -1       n.a.     ratan tata

In [14]:
# The first row in the csv is skipped
df = pd.read_csv("stock_data.csv", skiprows=1)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [15]:
df = pd.read_csv("stock_data.csv", header=1) # skiprows and header are kind of same, it means new header is at row 1(in csv it's 2 but in code it'll be 1 since counting starts from 0)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [23]:
df = pd.read_csv("stock_data.csv", skiprows=1, header=None, names = ["ticker","eps","revenue","people"])
# skiprows=1, for demonstration purpose only, we can delete the header row as well
df

              ticker  eps revenue         people
GOOGL          27.82   87     845     larry page
WMT             4.61  484      65           n.a.
MSFT              -1   85      64     bill gates
RIL    not available   50    1023  mukesh ambani
TATA             5.6   -1    n.a.     ratan tata

In [25]:
df = pd.read_csv("stock_data.csv",  nrows=3) #will read three rows other than the headers
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [27]:
df = pd.read_csv("stock_data.csv", na_values=["n.a.", "not available"])
# "n.a.", "not available" are changed to NaN
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

#### we can do changing of value w.r.t columns as well by the help of dictionary, this is data wrangling/munging

In [49]:
df = pd.read_csv("stock_data.csv",  na_values={
        'eps': ['not available'],
        'revenue': [-1],
        'people': ['not available','n.a.'],
        'price' : ['n.a.']
    })
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

### <font color="green">Write to CSV</color>

In [51]:
# df.to_csv("new.csv") This will write the indexes too
df.to_csv("new.csv", index=False) #this won't write the indexes

In [47]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

#### Suppose we want to exclude the header and then save that data

In [52]:
df.to_csv("new.csv",header=False)

#### Suppose we want to write a few columns only

In [53]:
df.to_csv("new.csv", columns=["tickers","price","people"], index=False)

### <font color="green">Read Excel</color>

In [54]:
df = pd.read_excel("stock_dataxls.xlsx","Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [70]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return "None"
    return cell

def convert_price_cell(cell):
    if cell=="n.a.":
        return "None"
    return cell

def convert_eps_cell(cell):
    if cell=="not available":
        return "None"
    return cell

# Converters are used to concert messy data into something meaningful
df = pd.read_excel("stock_dataxls.xlsx","Sheet1", converters= {
        'people': convert_people_cell,
        'price': convert_price_cell,
        'eps': convert_eps_cell
    })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65            NaN
2    MSFT     -1       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA    5.6       -1   NaN     ratan tata

<!-- ### <font color="blue">Write to Excel</color> -->

In [73]:
df.to_excel("newxls.xlsx", sheet_name="stocks", index=False, startrow=1, startcol=1)

#### **Write two dataframes to two separate sheets in excel**

In [74]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [75]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")